
/*Задача 1. Да се състави програма, която извежда сумата на четните цифри на зададено ця-
ло число.*/
#include <iostream>
#include <cstdlib>
using namespace std; 

int main(void) 
{
    system("chcp 1251");
    int m, sum {0}, c; //Въведеното число, Сума , c-поредна отделена цифра от чслото
    cout << "Въведете число: "; cin >> m; 
    while (m > 0)//dokato m e po golqmo
    { 
        c = m % 10; //Отделяне на цифра
        if (c % 2 == 0) sum += c; //Проверява дали е четно, ако не е пасти да яде 
        m = m / 10; //Дели докато не е 0 
    }
    cout << "Сума на цифрите: " << sum << "\n"; 
    return 0; 
}